---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericBumpMap
source: html/fb311dd8-5106-6da8-f53d-a46d3e6912db.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericBumpMap Property

The property labeled "Bump" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericBumpMap { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.